In [27]:
import pandas as pd

In [34]:
data = {
    "Name": ["Téo", "Nah", "Maria", "Nah", "Lara", "Téo"],
    "Age": [32,33,2,33,31,32],
    'Updated_at': [1,2,3,1,2,3]
}

In [35]:
df = pd.DataFrame(data)
df = df.sort_values(by='Name')
df = df.drop_duplicates(subset='Updated_at', keep='first')
df

    Name  Age  Updated_at
4   Lara   31           2
2  Maria    2           3
3    Nah   33           1

In [36]:
df = pd.DataFrame(data)
df = df.drop_duplicates(subset=['Age'], keep='last')
df

    Name  Age  Updated_at
2  Maria    2           3
3    Nah   33           1
4   Lara   31           2
5    Téo   32           3